<?php

namespace Database\Seeders;

use App\Models\Post;
use Carbon\Carbon;
use Illuminate\Database\Seeder;

class PostSeeder extends Seeder
{
    public function run(): void
    {
        $body = '<h2><strong>امروزه بهترین نوع پوشاک رو میبینیم</strong></h2><p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز</p><p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیازلورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز</p><blockquote><p><strong>“لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است”</strong></p></blockquote><p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است</p><p><img class="image_resized" src="http://localhost/roiser/assets/img/blog/blog-details-img-1.png" alt="blog"><img class="image_resized" src="http://localhost/roiser/assets/img/blog/blog-details-img-2.png" alt="blog"></p><p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک استلورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است</p>';
        $now = Carbon::now();

        Post::insert([
            [
                'user_id' => 1,
                'category_id' => 5,
                'title' => 'پوشاک مناسب تابستان',
                'slug' => 'summer-clothing',
                'excerpt' => 'امروزه بهترین نوع پوشاک رو میبینیملورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای...',
                'body' => $body,
                'status' => 1,
                'created_at' => $now,
                'updated_at' => $now,
            ],
            [
                'user_id' => 1,
                'category_id' => 5,
                'title' => '12 روز یا 12 سال؟',
                'slug' => '12-days-or-12-years',
                'excerpt' => 'امروزه بهترین نوع پوشاک رو میبینیملورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای...',
                'body' => $body,
                'status' => 1,
                'created_at' => $now,
                'updated_at' => $now,
            ],
            [
                'user_id' => 1,
                'category_id' => 5,
                'title' => 'گزارش اختصاصی: گردهمایی بزرگ فعالان صنعت پوشاک ایران به میزبانی انجمن نشان‌های تجاری',
                'slug' => 'Exclusive-Report-Large-gathering-Iranian-clothing',
                'excerpt' => 'امروزه بهترین نوع پوشاک رو میبینیملورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای...',
                'body' => $body,
                'status' => 1,
                'created_at' => $now,
                'updated_at' => $now,
            ],
            [
                'user_id' => 1,
                'category_id' => 5,
                'title' => 'حضور رامینا ترابی در کن ۲۰۲۵',
                'slug' => 'Ramina-Torabis-presence-Cannes-2025',
                'excerpt' => 'امروزه بهترین نوع پوشاک رو میبینیملورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای...',
                'body' => $body,
                'status' => 1,
                'created_at' => $now,
                'updated_at' => $now,
            ],
            [
                'user_id' => 1,
                'category_id' => 5,
                'title' => 'مد چیست؟ همه چیز درباره ی مد و فشن',
                'slug' => 'What-is-fashion',
                'excerpt' => 'امروزه بهترین نوع پوشاک رو میبینیملورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای...',
                'body' => $body,
                'status' => 1,
                'created_at' => $now,
                'updated_at' => $now,
            ],
            [
                'user_id' => 1,
                'category_id' => 5,
                'title' => '5 راه برای ست کردن تیشرت لانگ با انواع استایل',
                'slug' => 'ways-to-pair-long-t-shirt',
                'excerpt' => 'امروزه بهترین نوع پوشاک رو میبینیملورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای...',
                'body' => $body,
                'status' => 1,
                'created_at' => $now,
                'updated_at' => $now,
            ],
            [
                'user_id' => 1,
                'category_id' => 5,
                'title' => 'وسایل طراحی لباس',
                'slug' => 'clothing-design-tools',
                'excerpt' => 'امروزه بهترین نوع پوشاک رو میبینیملورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای...',
                'body' => $body,
                'status' => 1,
                'created_at' => $now,
                'updated_at' => $now,
            ],
            [
                'user_id' => 1,
                'category_id' => 5,
                'title' => 'برند نیو بوی با برندهای برتر ایرانی در گردهمایی برندها',
                'slug' => 'newboy-top-iranian-brands',
                'excerpt' => 'امروزه بهترین نوع پوشاک رو میبینیملورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای...',
                'body' => $body,
                'status' => 1,
                'created_at' => $now,
                'updated_at' => $now,
            ],
            [
                'user_id' => 1,
                'category_id' => 5,
                'title' => 'همه چیز درباره ی برند نیوبوی',
                'slug' => 'about-newboy-brand',
                'excerpt' => 'امروزه بهترین نوع پوشاک رو میبینیملورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای...',
                'body' => $body,
                'status' => 1,
                'created_at' => $now,
                'updated_at' => $now,
            ],
        ]);
    }
}
