<?php

namespace Database\Seeders;

use App\Enums\CategoryType;
use App\Models\Product;
use Carbon\Carbon;
use DB;
use Illuminate\Database\Seeder;

class ProductSeeder extends Seeder
{
    public function run(): void
    {
        $now = Carbon::now();

        $productCategory = DB::table('categories')
            ->where('type', CategoryType::Product)
            ->first();

        Product::insert([
            [
                'category_id' => $productCategory->id,
                'name' => 'کیف پنبه ای اداری ضد آب',
                'status' => 2,
                'discount_type' => 2,
                'price' => 450000,
                'discount' => 150000,
                'final_price' => 300000,
                'stock' => 2,
                'long_description' => '<p><span style="background-color:rgb(255,255,255);color:rgb(33,37,41);">لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.</span></p>',
                'short_description' => '<p><span style="background-color:rgb(255,255,255);color:rgb(33,37,41);">لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، </span></p>',
                'additional_information' => '<figure class="table"><table><tbody><tr><td>ثقفثقف</td><td>یبلیبل</td><td>زرزذ</td><td>رذدذرد</td></tr><tr><td>لبابا</td><td>ذپذدپ</td><td>ذپدذپ</td><td>یلبیلیل</td></tr></tbody></table></figure>',
                'created_at' => $now,
                'updated_at' => $now,
            ],
            [
                'category_id' => $productCategory->id,
                'name' => 'لباس مجلسی مونیکا دیارا',
                'status' => 1,
                'discount_type' => 1,
                'price' => 150000,
                'discount' => 4,
                'final_price' => 144000,
                'stock' => 4,
                'long_description' => '<p><span style="background-color:rgb(255,255,255);color:rgb(33,37,41);">لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.</span></p>',
                'short_description' => '<p><span style="background-color:rgb(255,255,255);color:rgb(33,37,41);">لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، </span></p>',
                'additional_information' => '<figure class="table"><table><tbody><tr><td>ثقفثقف</td><td>یبلیبل</td><td>زرزذ</td><td>رذدذرد</td></tr><tr><td>لبابا</td><td>ذپذدپ</td><td>ذپدذپ</td><td>یلبیلیل</td></tr></tbody></table></figure>',
                'created_at' => $now,
                'updated_at' => $now,
            ],
            [
                'category_id' => $productCategory->id,
                'name' => 'صندل گل مشکل اونیما',
                'status' => 1,
                'discount_type' => 1,
                'price' => 200000,
                'discount' => 0,
                'final_price' => 200000,
                'stock' => 2,
                'long_description' => '<p><span style="background-color:rgb(255,255,255);color:rgb(33,37,41);">لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.</span></p>',
                'short_description' => '<p><span style="background-color:rgb(255,255,255);color:rgb(33,37,41);">لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، </span></p>',
                'additional_information' => '<figure class="table"><table><tbody><tr><td>ثقفثقف</td><td>یبلیبل</td><td>زرزذ</td><td>رذدذرد</td></tr><tr><td>لبابا</td><td>ذپذدپ</td><td>ذپدذپ</td><td>یلبیلیل</td></tr></tbody></table></figure>',
                'created_at' => $now,
                'updated_at' => $now,
            ],
            [
                'category_id' => $productCategory->id,
                'name' => 'پیراهن بهاره ',
                'status' => 1,
                'discount_type' => 1,
                'price' => 250000,
                'discount' => 0,
                'final_price' => 250000,
                'stock' => 10,
                'long_description' => '<p><span style="background-color:rgb(255,255,255);color:rgb(33,37,41);">لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.</span></p>',
                'short_description' => '<p><span style="background-color:rgb(255,255,255);color:rgb(33,37,41);">لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، </span></p>',
                'additional_information' => '<figure class="table"><table><tbody><tr><td>ثقفثقف</td><td>یبلیبل</td><td>زرزذ</td><td>رذدذرد</td></tr><tr><td>لبابا</td><td>ذپذدپ</td><td>ذپدذپ</td><td>یلبیلیل</td></tr></tbody></table></figure>',
                'created_at' => $now,
                'updated_at' => $now,
            ],
            [
                'category_id' => $productCategory->id,
                'name' => 'ژاکت پانچو بین المللی',
                'status' => 2,
                'discount_type' => 1,
                'price' => 264000,
                'discount' => 0,
                'final_price' => 264000,
                'stock' => 10,
                'long_description' => '<p><span style="background-color:rgb(255,255,255);color:rgb(33,37,41);">لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.</span></p>',
                'short_description' => '<p><span style="background-color:rgb(255,255,255);color:rgb(33,37,41);">لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، </span></p>',
                'additional_information' => '<figure class="table"><table><tbody><tr><td>ثقفثقف</td><td>یبلیبل</td><td>زرزذ</td><td>رذدذرد</td></tr><tr><td>لبابا</td><td>ذپذدپ</td><td>ذپدذپ</td><td>یلبیلیل</td></tr></tbody></table></figure>',
                'created_at' => $now,
                'updated_at' => $now,
            ],
        ]);
    }
}
